{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Dense", "config": {"input_dtype": "float32", "b_constraint": null, "init": "glorot_uniform", "batch_input_shape": [null, 784], "W_regularizer": null, "input_dim": 784, "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_1", "output_dim": 100, "W_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 100, "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_2", "output_dim": 70, "W_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 70, "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_3", "output_dim": 30, "W_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 30, "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_4", "output_dim": 10, "W_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "softmax"}}]}